app/controllers/cats_controller.rb

  def update
    if @cat.update(cat_params)
---
UPDATE "cats" SET "name" = $1, "breed" = $2, "age" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "Bobby"], ["breed", "www"], ["age", 9], ["updated_at", "2020-11-24 18:35:17.449787"], ["id", 2]]

  def destroy
    @cat.destroy
---
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 4]]

  def set_cat
    @cat = Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]