app/controllers/colonies_controller.rb

SELECT "colonies".* FROM "colonies"
---
  def index
      @colonies = Colony.all

SELECT "colonies".* FROM "colonies" WHERE "colonies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @colony = Colony.find(params[:id])

UPDATE "colonies" SET "name" = $1, "updated_at" = $2 WHERE "colonies"."id" = $3  [["name", "ABC faf"], ["updated_at", "2020-11-26 20:38:30.760955"], ["id", 6]]
---
    def update
      if @colony.update(colony_params)

INSERT INTO "colonies" ("name", "borough", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asfsf"], ["borough", "fsfsf"], ["created_at", "2020-11-26 20:30:53.363799"], ["updated_at", "2020-11-26 20:30:53.363799"]]
---
    def create
      @colony =  Colony.new(colony_params)
      if @colony.save

DELETE FROM "cats_colonies" WHERE "cats_colonies"."colony_id" = $1  [["colony_id", 8]]
DELETE FROM "colonies" WHERE "colonies"."id" = $1  [["id", 8]]
---
      def destroy
        @colony.destroy

SELECT "colonies".* FROM "colonies" WHERE "colonies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_colony
      @colony = Colony.find(params[:id])